/* Од тастатура се внесуваат димензиите на една матрица (m,n <= 100), а потоа и елементите од матрицата.
 * Да се трансформира матрицата така што средниот елемент во секоја редица ќе се замени со разликата (по апсолутна вредност)
 * на сумата на елементите во првата половина од редицата и сумата на елементите во втората половина на редицата. Ако матрицата има парен број колони,
 * се менува вредноста на средните два елемента. Средниот/те елемент/и влегува/ат во сумите (при непарен број на колони, средниот елемент влегува во двете суми!).
 * Да се испечати на екран променетата матрица. */
#include <iostream>
#include <cmath>

using namespace std;

int main () {

    int n, m;
    cin >> n >> m;
    int a[n][m];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
        }
    }
    if (m % 2 == 1) {
        for (int i = 0; i < n; i++) {
            int sum1 = 0, sum2 = 0;
            for (int j = 0; j < (m/2)+1; j++) {
                sum1 += a[i][j];
            }
            for (int j = m/2; j < m; j++) {
                sum2 += a[i][j];
            }
            int diff = abs(sum1-sum2);
            a[i][m/2] = diff;
        }
    } else {
        for (int i = 0; i < n; i++) {
            int sum1 = 0, sum2 = 0;
            for (int j = 0; j < m/2; j++) {
                sum1 += a[i][j];
            }
            for (int j = m/2; j < m; j++) {
                sum2 += a[i][j];
            }
            int diff = abs(sum1-sum2);
            a[i][m/2] = diff;
            a[i][(m/2)-1] = diff;
        }
    }
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cout << a[i][j] << " ";
        }
        cout << endl;
    }


    return 0;
}
