/* Еден елемент од матрица ја дели матрицата на 4 квадранти (прикажани на сликата). Притоа самиот елемент кој ја дели матрицата припаѓа во четвртиот квадрант (-5 во примерот на сликата).

Од стандарден влез се внесува матрица со димензии NxM (1 <= N, M < 100). Потоа се внесуваат два броеви кои претставуваат индекси на еден елемент од матрицата.

Да се најдат сумите на секој од квадрантите и да се испечатат на стандарен излез. Притоа се печати сумата за првиот квадрант, па за вториот, па третиот и на крај за четвртиот. Доколку не може да се креира квадрант, тогаш за сумата на тој квадрант треба да се испечати 0. */
#include <iostream>
#include <cstring>

using namespace std;

int main() {

    int n, m;
    cin >> n >> m;
    int a[n][m];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
        }
    }
    int x, y;
    cin >> x >> y;
    int suma1 = 0, suma2 = 0, suma3 = 0, suma4 = 0;
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            if (i < x && j < y) {
                suma2 += a[i][j];
            } else if (i >= x && j < y) {
                suma3 += a[i][j];
            } else if (i < x && j >= y) {
                suma1 += a[i][j];
            } else {
                suma4 += a[i][j];
            }
        }
    }
    cout << suma1 << " " << suma2 << " " << suma3 << " " << suma4 << endl;

    return 0;
}
