/* Од стандарден влез се чита ливче во спортска обложувалница.

Во првиот ред е запишана сумата на уплата (цел број).

Потоа во секој нареден ред кој се чита од стандарден влез (се додека не се прочита знакот #) е запишан по еден тип во следниот формат:

ab12 1 1.25
Првиот број е шифрата на типот (низа од знаци која не е подолга од 9 знаци), вториот број е типот (може да биде 1, 0 или 2) додека третиот број е коефициентот (реален број).

Ваша задача е да го испечатите типот со најголем коефициент како и можната добивка на ливчето. Доколку има повеќе типови со ист максимален коефициент, да се испечати првиот.

Можната добивка се пресметува како производ на сите коефициенти со сумата на уплата. */
#include <iostream>
#include <cstring>

using namespace std;

int main() {

    int uplata;
    cin >> uplata;
    char a[10];
    char max_sif[10];
    int tip, max_tip = 0;
    float koef, max_koef = 0, dobivka, pro = 1;
    while (true) {
        cin >> a;
        if (a[0] == '#') {
            break;
        }
        cin >> tip;
        cin >> koef;
        if (koef > max_koef) {
            max_koef = koef;
            max_tip = tip;
            strcpy(max_sif,a);
        }
        pro *= koef;
    }
    dobivka = pro*uplata;
    cout << max_sif << " " << max_tip << " " << max_koef << endl;
    cout << dobivka << endl;

    return 0;
}
