/* Да се имплементира рекурзивна функција која за низа од цели броеви $[a{0}, a{1}, ..., a_{n-1}]$ ќе ја пресмета вредноста на непрекинатата дропка.
 * Да се напише програма во која се чита цел број N, по што се читаат елементите на низа од N цели броеви (не повеќе од 100).
 * Потоа се повикува рекурзивната функција и се печати резултатот во нов ред. */
#include <iostream>
#include <cstring>

using namespace std;

double v(int a[], int n, int i) {
    if (i == n-1) {
        return a[n-1];
    } else {
        return a[i] + 1.00/v(a,n,i+1);
    }
}

int main () {

    int n;
    int a[100];
    cin >> n;
    for (int i = 0; i < n; i++) {
        cin >> a[i];
    }
    cout << v(a,n,0) << endl;

    return 0;
}