/* Од стандарден влез се читаат елементите на една матрица (A), составена од природни броеви. Прво се читаат бројот на редици N и бројот на колони M на матрицата (N, M < 100),
 * а потоа и самите елементи на матрицата.

За секоја редица, да се испечати индексот на редицата и бројот на штосни броеви во таа редица во формат indeks_na_redica: broj_na_stosni_broevi_vo_taa_redica (види тест пример).

Штосен број е број чија парност е иста со парноста на збирот од индексите на редицата и колоната на елементот. */
#include <iostream>

using namespace std;

int main() {

    int n, m;
    cin >> n >> m;
    int a[n][m];
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cin >> a[i][j];
        }
    }
    int stosni;
    for (int i = 0; i < n; i++) {
        stosni = 0;
        for (int j = 0; j < m; j++) {
            if ((i+j) % 2 == 0 && a[i][j] % 2 == 0) {
                stosni++;
            } else if ((i+j) % 2 == 1 && a[i][j] % 2 == 1) {
                stosni++;
            }
        }
        cout << i << ": " << stosni << endl;
    }

    return 0;
}
